src/french/exam.tex
% Created 2018-05-16 Wed 22:19
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{minted}
\author{Sagindyk Urazayev}
\date{\today}
\title{French Examination tenses}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.3.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

\newpage
\section{Passé}
\label{sec-1}
\subsection{Passé Composé}
\label{sec-1-1}

\subsubsection{Avoir}
\label{sec-1-1-1}

avoir + verbe(é) (manger-mangé, parler-parlé, finir-fini)

\begin{center}
\begin{tabular}{ll}
j' & ai\\
tu & as\\
il & a\\
elle & a\\
nous & avons\\
vous & avez\\
ils & ont\\
elles & ont\\
\end{tabular}
\end{center}

\begin{enumerate}
\item Exceptions
\label{sec-1-1-1-1}

Avoir - eu

\item Other verbs
\label{sec-1-1-1-2}

\begin{center}
\begin{tabular}{ll}
ouvrir & ouvert\\
offrir & offert\\
\end{tabular}
\end{center}
\end{enumerate}

\subsubsection{Être}
\label{sec-1-1-2}

\begin{center}
\begin{tabular}{ll}
je & suis\\
tu & es\\
il & est\\
elle & est\\
nous & sommes\\
vous & etes\\
ils & sont\\
elles & sont\\
\end{tabular}
\end{center}

\begin{enumerate}
\item Exceptions
\label{sec-1-1-2-1}

\begin{center}
\begin{tabular}{ll}
aller & allé\\
venir & venu\\
partir & parti\\
arriver & arrivé\\
monter & monté\\
entrer & entré\\
rester & resté\\
sortir & sorti\\
descendre & descendu\\
tomber & tombé\\
mourir & mort\\
naitre & né\\
passer & passé\\
tourner & tourné\\
\end{tabular}
\end{center}

\item Warnings!
\label{sec-1-1-2-2}

\begin{center}
\begin{tabular}{ll}
partir & nous part \textbf{ons}\\
finir & nous fini \textbf{ssons}\\
\end{tabular}
\end{center}
\end{enumerate}

\subsection{Passé récent}
\label{sec-1-2}

venir (au present) + de + infinitif

\section{Present}
\label{sec-2}

\subsection{Present progressif}
\label{sec-2-1}

être (au present) + en train de + infinitif

\section{Futur}
\label{sec-3}

\subsection{Futur simple}
\label{sec-3-1}

infinif + ai

\subsubsection{Exceptions}
\label{sec-3-1-1}

\begin{center}
\begin{tabular}{ll}
aller & ir\\
venir & viendr\\
avoir & aur\\
etre & ser\\
voiloir & voudr\\
pouvoir & pourr\\
faire & fer\\
courir & courr\\
mourir & mourr\\
devoir & devr\\
recevoir & recevr\\
voir & verr\\
envoyer & enverr\\
falloir & faudr\\
pleuvoir & pleuvr\\
\end{tabular}
\end{center}

\subsection{Futur Proche}
\label{sec-3-2}

aller + infinitif
% Emacs 25.3.1 (Org mode 8.2.10)
\end{document}